lvx/base/Documents/бит_кзн_РеестрПлатежей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>бит_кзн_РеестрПлатежей</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.бит_РеестрыПлатежей</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТаблицаПлатежи</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ФормаОплаты</Name>
							<Type>
								<v8:Type>cfg:EnumRef.бит_ВидыДенежныхСредств</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Организация</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Организации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВалютаДокумента</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПлатежнаяПозиция</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.бит_кзн_ПлатежнаяПозиция</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗаявкаПлатежнаяПозиция</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.бит_кзн_ПлатежнаяПозиция</v8:Type>
								<v8:Type>cfg:DocumentRef.бит_кзн_ЗаявкаНаПереводСредствВДругуюОрганизацию</v8:Type>
								<v8:Type>cfg:DocumentRef.бит_кзн_ЗаявкаНаПеремещениеДенежныхСредств</v8:Type>
								<v8:Type>cfg:DocumentRef.бит_кзн_ЗаявкаНаРасходованиеСредств</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Статус</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_СтатусыОбъектов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОдиночнаяПозиция</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Оплачено</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗаблокироватьСтроку</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПлатежныйДокумент</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.РасходныйКассовыйОрдер</v8:Type>
								<v8:Type>cfg:DocumentRef.СписаниеБезналичныхДенежныхСредств</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаКОплате</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаДокумента</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВалютаПлатежа</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаПлан</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаОстаток</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

lvx/base/Documents/бит_кзн_РеестрПлатежей/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс
	
#Область Проведение

// Описывает учетные механизмы используемые в документе для регистрации в механизме проведения.
//
// Параметры:
//  МеханизмыДокумента - Массив - список имен учетных механизмов, для которых будет выполнена
//              регистрация в механизме проведения.
//
Процедура ЗарегистрироватьУчетныеМеханизмы(МеханизмыДокумента) Экспорт
	// ++ ЕРП 
	Совместимо = Истина;
	// -- ЕРП 
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда	
		Возврат;	
	КонецЕсли; 
	
	УстановитьИсключениеПроверкиСтатусаОплаты();
	
	бит_ОбщегоНазначенияПереопределяемый.ПередЗаписьюДокумента(ЭтотОбъект, РежимЗаписи, РежимПроведения);
	
	ПодготовитьОбъектыДляОбновленияСтатуса();
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ЭтоНовый() Тогда	
		Ответственный = Пользователи.ТекущийПользователь();	
	КонецЕсли; 
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	бит_НастройкиДоступностиЭлементовФорм.ЗаполнитьПроверяемыеРеквизиты(ЭтотОбъект, ПроверяемыеРеквизиты);
	ПроверкаЗаполненияСпискаПлатежей(Отказ);
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)

	бит_ОбщегоНазначенияПереопределяемый.ОбработкаПроведенияНачало(ЭтотОбъект);

	ПараметрыПроведения = Документы.бит_кзн_РеестрПлатежей.ПодготовитьПараметрыПроведения(Ссылка, Отказ);
	Если Отказ Тогда
		Возврат;
	КонецЕсли; 

	Документы.бит_кзн_РеестрПлатежей.СформироватьРеестрыПлатежей(
		ПараметрыПроведения.РеестрПлатежейТаблица, 
		ПараметрыПроведения.РеестрПлатежейРеквизиты, Движения);
		
	ОбновитьСтатусыЗаявок();
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
		
	бит_ОбщегоНазначенияПереопределяемый.ОбработкаУдаленияПроведения(ЭтотОбъект, Отказ);
	
	ОбновитьСтатусыЗаявок();
		
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ПроверкаЗаполненияСпискаПлатежей(Отказ)

	Позиции = Новый Соответствие; 

	ШаблонСообщения = НСтр("ru = 'Значение повторяется.'; en = 'The value is repeated.'");
	СинонимПоля 	= НСтр("ru = 'Заявка/Платежная позиция'; en = 'Application / Payment position'");
	СинонимТаблицы  = НСтр("ru = 'Платежи'; en = 'Payments'");
	
	Если НЕ ЗначениеЗаполнено(ТаблицаПлатежи) Тогда
		Возврат;	
	КонецЕсли;

	// Дублирование.
	Для каждого СтрокаТаблицы Из ТаблицаПлатежи Цикл
		Если Позиции.Получить(СтрокаТаблицы.ПлатежнаяПозиция) <> Неопределено Тогда
			Поле = "ТаблицаПлатежи[%1].ПлатежнаяПозиция";
			Поле = СтрШаблон(Поле, Формат(СтрокаТаблицы.НомерСтроки - 1, "ЧН=0; ЧГ="));
			
			ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения(
								"КОЛОНКА", "КОРРЕКТНОСТЬ", СинонимПоля,
								СтрокаТаблицы.НомерСтроки, СинонимТаблицы, ШаблонСообщения);
			
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, Поле, "Объект", Отказ);
		Иначе	
			Позиции.Вставить(СтрокаТаблицы.ПлатежнаяПозиция, СтрокаТаблицы.НомерСтроки);
		КонецЕсли;
	КонецЦикла; 	
	
	// Включение в реестр.
	Если НЕ ПолучитьФункциональнуюОпцию("бит_ВключатьПлатежнуюПозициюВНесколькоРеестров") Тогда
		СписокПлатежей = ТаблицаПлатежи.ВыгрузитьКолонки("ПлатежнаяПозиция");
		СписокПлатежей.Колонки.Добавить("НомерСтроки", ОбщегоНазначения.ОписаниеТипаЧисло(4));
		СписокПлатежей.Колонки.Добавить("Ссылка", Новый ОписаниеТипов("ДокументСсылка.бит_кзн_РеестрПлатежей"));
		
		Для каждого СтрокаТаблицы Из ТаблицаПлатежи Цикл
			НоваяСтрока = СписокПлатежей.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицы);
			НоваяСтрока.НомерСтроки = СписокПлатежей.Количество();
			НоваяСтрока.Ссылка 		= Ссылка;
		КонецЦикла; 
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("СписокПлатежей", СписокПлатежей);
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Список.НомерСтроки КАК НомерСтроки,
		|	Список.Ссылка КАК Ссылка,
		|	Список.ПлатежнаяПозиция КАК ПлатежнаяПозиция
		|ПОМЕСТИТЬ СписокПлатежей
		|ИЗ
		|	&СписокПлатежей КАК Список
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СписокПлатежей.НомерСтроки КАК НомерСтроки,
		|	СписокПлатежей.ПлатежнаяПозиция КАК ПлатежнаяПозиция,
		|	РеестрыПлатежей.РеестрПлатежей КАК РеестрПлатежей
		|ИЗ
		|	СписокПлатежей КАК СписокПлатежей
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.бит_РеестрыПлатежей КАК РеестрыПлатежей
		|		ПО СписокПлатежей.ПлатежнаяПозиция = РеестрыПлатежей.ПлатежнаяПозиция
		|			И СписокПлатежей.Ссылка <> РеестрыПлатежей.РеестрПлатежей";
		
		РезультатЗапроса = Запрос.Выполнить();
		Выборка 		 = РезультатЗапроса.Выбрать();
		
		ШаблонСообщения = НСтр("ru = 'Документ %1 включен в реестр %2.'; en = 'The document %1 is included in the registry %2.'");
		
		Пока Выборка.Следующий() Цикл
			
			Пояснение = СтрШаблон(ШаблонСообщения, Выборка.ПлатежнаяПозиция, Выборка.РеестрПлатежей);
			Поле 	  = "ТаблицаПлатежи[%1].ПлатежнаяПозиция";
			Поле 	  = СтрШаблон(Поле, Формат(Выборка.НомерСтроки - 1, "ЧН=0; ЧГ="));
			
			ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения(
				"КОЛОНКА", "КОРРЕКТНОСТЬ", СинонимПоля,
				Выборка.НомерСтроки, СинонимТаблицы, Пояснение);
			
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, Поле, "Объект", Отказ);
		КонецЦикла;
	КонецЕсли; 

КонецПроцедуры

Процедура ПодготовитьОбъектыДляОбновленияСтатуса()
	
	МассивОбъектов = ТаблицаПлатежи.ВыгрузитьКолонку("ЗаявкаПлатежнаяПозиция"); 
	МассивПозиций  = ТаблицаПлатежи.ВыгрузитьКолонку("ПлатежнаяПозиция");
	Для Каждого НоваяПозиция Из МассивПозиций Цикл
		МассивОбъектов.Добавить(НоваяПозиция);
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЗаявкиВРеесте.ЗаявкаПлатежнаяПозиция КАК Заявка,
	|	ЗаявкиВРеесте.ПлатежнаяПозиция КАК ПлатежнаяПозиция
	|ИЗ
	|	Документ.бит_кзн_РеестрПлатежей.ТаблицаПлатежи КАК ЗаявкиВРеесте
	|ГДЕ
	|	ЗаявкиВРеесте.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Если ЗначениеЗаполнено(Выборка.Заявка) Тогда
			МассивОбъектов.Добавить(Выборка.Заявка);
		КонецЕсли;
		Если ЗначениеЗаполнено(Выборка.ПлатежнаяПозиция) Тогда
			МассивОбъектов.Добавить(Выборка.ПлатежнаяПозиция);
		КонецЕсли;
	КонецЦикла;
	бит_РаботаСКоллекциями.УдалитьПовторяющиесяЭлементыМассива(МассивОбъектов);
	ДополнительныеСвойства.Вставить("ОбъектыДляОбновленияСтатуса", МассивОбъектов);
	
КонецПроцедуры

Процедура ОбновитьСтатусыЗаявок()
	
	Перем ОбъектыДляОбновленияСтатуса;
	
	Если НЕ ДополнительныеСвойства.Свойство("ОбъектыДляОбновленияСтатуса", ОбъектыДляОбновленияСтатуса) Тогда
		Возврат;
	КонецЕсли;
	
	Для каждого СсылкаНаОбъект Из ОбъектыДляОбновленияСтатуса Цикл
		Если НЕ ЗначениеЗаполнено(СсылкаНаОбъект) Тогда
			Продолжить;
		КонецЕсли;
		
		бит_ВизированиеСервер.УстановитьСтатус(СсылкаНаОбъект.ПолучитьОбъект());
	КонецЦикла;
	
КонецПроцедуры

Процедура УстановитьИсключениеПроверкиСтатусаОплаты()
	
	Если Ссылка.Пустая() Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТаблицаПлатежей.ПлатежныйДокумент КАК ПлатежныйДокумент
	|ПОМЕСТИТЬ ТекущиеПлатежи
	|ИЗ
	|	&ТаблицаПлатежей КАК ТаблицаПлатежей
	|ГДЕ
	|	ТаблицаПлатежей.ПлатежныйДокумент <> НЕОПРЕДЕЛЕНО";
	Запрос.УстановитьПараметр("ТаблицаПлатежей", ТаблицаПлатежи.Выгрузить(, "ПлатежныйДокумент"));
	Запрос.Выполнить();
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТекущиеПлатежи.ПлатежныйДокумент КАК ПлатежныйДокумент
	|ИЗ
	|	ТекущиеПлатежи КАК ТекущиеПлатежи
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.бит_кзн_РеестрПлатежей.ТаблицаПлатежи КАК РеестрПлатежей
	|		ПО ТекущиеПлатежи.ПлатежныйДокумент = РеестрПлатежей.ПлатежныйДокумент
	|			И (РеестрПлатежей.Ссылка = &Ссылка)
	|ГДЕ
	|	РеестрПлатежей.ПлатежныйДокумент ЕСТЬ NULL";
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Если НЕ ЗначениеЗаполнено(Выборка.ПлатежныйДокумент) Тогда
			Продолжить;
		КонецЕсли;
		
		// Новый платежный документ в табличной части. Необходимо разрешить запись даже в статусе оплачено.
		ДополнительныеСвойства.Вставить("ОтключитьМеханизмПроверкиСтатуса", Истина);
		ДополнительныеСвойства.Вставить("ОтключитьМеханизмНастройкиДоступности", Истина);
		Возврат;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Иначе
  ВызватьИсключение НСтр("ru='Недопустимый вызов объекта на клиенте.';en='Invalid object call on client'");
#КонецЕсли
